app/Controllers/Admin.php

    public function user()
    {
        $user = $this->usermodel->findAll();
---
SELECT *
FROM `user`

    public function delete($id)
    {
        $this->usermodel->delete($id);
---
DELETE FROM `user`
WHERE `id` IN ('45')