app/Controllers/Book.php

SELECT *
FROM `book`
---
    public function index()
    {
        $buku = $this->bookmodel->findAll();