app/Models/BookModel.php

    public function hitungBook()
    {
        $builder = $this->db->table('book');
        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `book`