app/Models/InoutModel.php

    public function hitungInout()
    {
        $builder = $this->db->table('kelmas');
        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `kelmas`