app/Models/LoginModel.php

SELECT *
FROM `user`
WHERE `username` = 'zahra'
AND `password` = '762434382de3825b08fe148aa65ea7c87c2ae480'
---
    public function cekLogin($username, $password)
    {
        return $this->db->table('user')->where(
            array(
                'username' => $username,
                'password' => $password,

            )
        )->get()->getRowArray();