app/Models/UserModel.php

    public function saveUser($data)
    {
        $query = $this->db->table($this->table)->insert($data);
---
INSERT INTO `user` (`id`, `namaUser`, `username`, `password`, `level`, `status`, `created_at`) VALUES (NULL, 'caca', 'cacasa', 'a16358be6e2306b153b1f071477e68837266075e', '1', 'Aktif', '2022-09-26 05:12:54')

    public function hitungUser()
    {
        $builder = $this->db->table('user');
        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user`